Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/svd/PIC32CM5164LE00100.svd
            <register>
               <name>CONFIG1</name>
               <description>External Interrupt Sense Configuration</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SENSE8</name>
                     <description>Input Sense Configuration 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE8Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN8</name>
                     <description>Filter Enable 8</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE9</name>
                     <description>Input Sense Configuration 9</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE9Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN9</name>
                     <description>Filter Enable 9</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE10</name>
                     <description>Input Sense Configuration 10</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE10Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN10</name>
                     <description>Filter Enable 10</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE11</name>
                     <description>Input Sense Configuration 11</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE11Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN11</name>
                     <description>Filter Enable 11</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE12</name>
                     <description>Input Sense Configuration 12</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE12Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN12</name>
                     <description>Filter Enable 12</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE13</name>
                     <description>Input Sense Configuration 13</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE13Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN13</name>
                     <description>Filter Enable 13</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE14</name>
                     <description>Input Sense Configuration 14</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE14Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN14</name>
                     <description>Filter Enable 14</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE15</name>
                     <description>Input Sense Configuration 15</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE15Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN15</name>
                     <description>Filter Enable 15</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEBOUNCEN</name>
               <description>Debouncer Enable</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DEBOUNCEN0</name>
                     <description>Debouncer Enable of EXTINT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN1</name>
                     <description>Debouncer Enable of EXTINT1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN2</name>
                     <description>Debouncer Enable of EXTINT2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN3</name>
                     <description>Debouncer Enable of EXTINT3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN4</name>
                     <description>Debouncer Enable of EXTINT4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN5</name>
                     <description>Debouncer Enable of EXTINT5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN6</name>
                     <description>Debouncer Enable of EXTINT6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN7</name>
                     <description>Debouncer Enable of EXTINT7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN8</name>
                     <description>Debouncer Enable of EXTINT8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN9</name>
                     <description>Debouncer Enable of EXTINT9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN10</name>
                     <description>Debouncer Enable of EXTINT10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN11</name>
                     <description>Debouncer Enable of EXTINT11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN12</name>
                     <description>Debouncer Enable of EXTINT12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN13</name>
                     <description>Debouncer Enable of EXTINT13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN14</name>
                     <description>Debouncer Enable of EXTINT14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBOUNCEN15</name>
                     <description>Debouncer Enable of EXTINT15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
